{"config": [{"config": {"dilation_rate": [1, 1], "name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "padding": "valid", "activity_regularizer": null, "kernel_size": [5, 5], "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "filters": 16, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "name": "conv2d_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "filters": 16, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_size": [5, 5], "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 128, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 43, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.4", "backend": "tensorflow"}